<script setup lang="ts">
import BlogHeader from '@/components/BlogHeader.vue';
import BlogCard from '@/components/BlogCard.vue'

const posts = [
  {
    id: 1,
    title: 'Вдохновение в каждом шаге',
    date: '9 Апреля',
    timeToRead: '2 мин',
    comments: '1',
    description: 'Наши путешественники находят вдохновение в каждом шаге своего пути.',
    fullDescription: 'Каждое утро, когда я просыпаюсь в палатке, окружённой лесом и горами, я чувствую, как природа наполняет меня энергией. Величественные вершины, покрытые зелёными лесами, напоминают мне о том, как важно сохранять связь с природой. Каждый шаг по тропе — это не просто движение вперёд, это путешествие внутрь себя, где я нахожу вдохновение и силу. В такие моменты я понимаю, что настоящая красота мира скрыта в его простоте и величии.',
    tags: ['Природа', 'Люди'],
    imageUrl: new URL('../assets/images/cards/img1.jpg', import.meta.url).href,
    commentsData: [
      {
        id: 1,
        author: 'Мира Гусева',
        avatarUrl: new URL('../assets/images/users-photo/photo.jpg', import.meta.url).href,
        content: 'Эти мгновения наполняют наши сердца радостью и любовью.',
        date: '9.04.2024 в 14:54'
      }
    ]
  },
  {
    id: 2,
    title: 'Моменты тишины и покоя',
    date: '6 Апреля',
    timeToRead: '3 мин',
    comments: '5',
    description: 'В такие моменты наши фотографы ощущают гармонию и умиротворение.',
    fullDescription: 'Каждое утро, когда я просыпаюсь в палатке, окружённой лесом и горами, я чувствую, как природа наполняет меня энергией. Величественные вершины, покрытые зелёными лесами, напоминают мне о том, как важно сохранять связь с природой. Каждый шаг по тропе — это не просто движение вперёд, это путешествие внутрь себя, где я нахожу вдохновение и силу. В такие моменты я понимаю, что настоящая красота мира скрыта в его простоте и величии.',
    tags: ['Природа', 'Животные'],
    imageUrl: new URL('../assets/images/cards/img2.jpg', import.meta.url).href,
    commentsData: [
      {
        id: 2,
        author: 'Мира Гусева',
        avatarUrl: new URL('../assets/images/users-photo/photo.jpg', import.meta.url).href,
        content: 'Эти мгновения наполняют наши сердца радостью и любовью.',
        date: '9.04.2024 в 14:54'
      }
    ]
  },
  {
    id: 3,
    title: 'Цвета природы в наших руках',
    date: '5 Апреля',
    timeToRead: '3 мин',
    comments: '10',
    description: 'Наши художники выражают всю красоту окружающего мира через творчество.',
    fullDescription: 'Каждое утро, когда я просыпаюсь в палатке, окружённой лесом и горами, я чувствую, как природа наполняет меня энергией. Величественные вершины, покрытые зелёными лесами, напоминают мне о том, как важно сохранять связь с природой. Каждый шаг по тропе — это не просто движение вперёд, это путешествие внутрь себя, где я нахожу вдохновение и силу. В такие моменты я понимаю, что настоящая красота мира скрыта в его простоте и величии.',
    tags: ['Природа', 'Искусство'],
    imageUrl: new URL('../assets/images/cards/img3.jpg', import.meta.url).href,
    commentsData: [
      {
        id: 3,
        author: 'Мира Гусева',
        avatarUrl: new URL('../assets/images/users-photo/photo.jpg', import.meta.url).href,
        content: 'Эти мгновения наполняют наши сердца радостью и любовью.',
        date: '9.04.2024 в 14:54'
      }
    ]
  },
  {
    id: 4,
    title: 'Семейные узы в дикой природе',
    date: '4 Апреля',
    timeToRead: '15 мин',
    comments: '6',
    description: 'Наблюдая за этими сценами, наши фотографы чувствуют тепло и единство.',
    fullDescription: 'Каждое утро, когда я просыпаюсь в палатке, окружённой лесом и горами, я чувствую, как природа наполняет меня энергией. Величественные вершины, покрытые зелёными лесами, напоминают мне о том, как важно сохранять связь с природой. Каждый шаг по тропе — это не просто движение вперёд, это путешествие внутрь себя, где я нахожу вдохновение и силу. В такие моменты я понимаю, что настоящая красота мира скрыта в его простоте и величии.',
    tags: ['Природа', 'Животные'],
    imageUrl: new URL('../assets/images/cards/img4.jpg', import.meta.url).href,
    commentsData: [
      {
        id: 4,
        author: 'Мира Гусева',
        avatarUrl: new URL('../assets/images/users-photo/photo.jpg', import.meta.url).href,
        content: 'Эти мгновения наполняют наши сердца радостью и любовью.',
        date: '9.04.2024 в 14:54'
      }
    ]
  },
  {
    id: 5,
    title: 'Гармония городских и природных пейзажей ',
    date: '3 Апреля',
    timeToRead: '2 мин',
    comments: '2',
    description: 'Этот вид напоминает нам о том, как природа и город могут сосуществовать в гармонии.',
    fullDescription: 'Каждое утро, когда я просыпаюсь в палатке, окружённой лесом и горами, я чувствую, как природа наполняет меня энергией. Величественные вершины, покрытые зелёными лесами, напоминают мне о том, как важно сохранять связь с природой. Каждый шаг по тропе — это не просто движение вперёд, это путешествие внутрь себя, где я нахожу вдохновение и силу. В такие моменты я понимаю, что настоящая красота мира скрыта в его простоте и величии.',
    tags: ['Природа', 'Искусство'],
    imageUrl: new URL('../assets/images/cards/img5.jpg', import.meta.url).href,
    commentsData: [
      {
        id: 5,
        author: 'Мира Гусева',
        avatarUrl: new URL('../assets/images/users-photo/photo.jpg', import.meta.url).href,
        content: 'Эти мгновения наполняют наши сердца радостью и любовью.',
        date: '9.04.2024 в 14:54'
      }
    ]
  },
  {
    id: 6,
    title: 'Моменты, которые остаются в сердце ',
    date: '1 Апреля',
    timeToRead: '4 мин',
    comments: '0',
    description: 'Эти мгновения наполняют наши сердца радостью и любовью.',
    fullDescription: 'Каждое утро, когда я просыпаюсь в палатке, окружённой лесом и горами, я чувствую, как природа наполняет меня энергией. Величественные вершины, покрытые зелёными лесами, напоминают мне о том, как важно сохранять связь с природой. Каждый шаг по тропе — это не просто движение вперёд, это путешествие внутрь себя, где я нахожу вдохновение и силу. В такие моменты я понимаю, что настоящая красота мира скрыта в его простоте и величии.',
    tags: ['Природа', 'Люди', 'Животные'],
    imageUrl: new URL('../assets/images/cards/img6.jpg', import.meta.url).href,
    commentsData: [
      {
        id: 6,
        author: 'Мира Гусева',
        avatarUrl: new URL('../assets/images/users-photo/photo.jpg', import.meta.url).href,
        content: 'Эти мгновения наполняют наши сердца радостью и любовью.',
        date: '9.04.2024 в 14:54'
      }
    ]
  },

]
</script>

<template>
  <div class="max-w-cards-w mx-auto bg-white p-7 rounded-xl">
    <div class="grid grid-cols-3 gap-x-5 gap-y-10">
      <BlogCard v-for="post in posts" :key="post.id" :post="post"
        @update-comments="(newComments) => post.commentsData = newComments" />
    </div>
  </div>
</template>
